# TY05 Rehmah

## Aim: Integrate data from multiple sources by merging and transforming datasets using Python's pandas library and data manipulation techniques.

In [1]:
import pandas as pd

In [2]:
data1 = {'ID':[1, 2, 3, 4],
         'Name':['Alice', 'Bob', 'Charlie', 'David'],
         'Age':[25, 30, 22, 28]}
df1 = pd.DataFrame(data1)
df1

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   22
3   4    David   28

In [3]:
data2 = {'ID':[2, 3, 4, 5],
         'City':['New York', 'San Francisco', 'Los Angeles', 'Chicago'],
         'Salary':[60000, 75000, None, 70000]}
df2 = pd.DataFrame(data2)
df2

   ID           City   Salary
0   2       New York  60000.0
1   3  San Francisco  75000.0
2   4    Los Angeles      NaN
3   5        Chicago  70000.0

In [4]:
merged_df = pd.merge(df1, df2, on='ID', how='inner')
print("Mergerd Dataset: ")
merged_df

Mergerd Dataset:

   ID     Name  Age           City   Salary
0   2      Bob   30       New York  60000.0
1   3  Charlie   22  San Francisco  75000.0
2   4    David   28    Los Angeles      NaN

In [5]:
merged_df['Birth Year'] = 2020 - merged_df['Age']
print("Transformed Dataset: ")
merged_df

Transformed Dataset:

   ID     Name  Age           City   Salary  Birth Year
0   2      Bob   30       New York  60000.0        1990
1   3  Charlie   22  San Francisco  75000.0        1998
2   4    David   28    Los Angeles      NaN        1992

In [6]:
mean_salary = merged_df['Salary'].mean()
merged_df['Salary'].fillna(mean_salary, inplace=True)
print("Dataset after handeling missing values: ")
merged_df

Dataset after handeling missing values:

   ID     Name  Age           City   Salary  Birth Year
0   2      Bob   30       New York  60000.0        1990
1   3  Charlie   22  San Francisco  75000.0        1998
2   4    David   28    Los Angeles  67500.0        1992

In [7]:
merged_df['Annual Income'] = merged_df['Salary'] * 12
print("Dataset with 'Annual Income' column: ")
merged_df

Dataset with 'Annual Income' column:

   ID     Name  Age           City   Salary  Birth Year  Annual Income
0   2      Bob   30       New York  60000.0        1990       720000.0
1   3  Charlie   22  San Francisco  75000.0        1998       900000.0
2   4    David   28    Los Angeles  67500.0        1992       810000.0

In [8]:
filtered_df = merged_df[merged_df['Age'] > 25 ]
print("Filtered Dataset ( Age > 25 ): ")
filtered_df

Filtered Dataset ( Age > 25 ):

   ID   Name  Age         City   Salary  Birth Year  Annual Income
0   2    Bob   30     New York  60000.0        1990       720000.0
2   4  David   28  Los Angeles  67500.0        1992       810000.0